Tutoriels/interIsoFoam/houleIrreguliere/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00000001;

boundaryField
{
    "(BOTTOM|outlet)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
	value		$internalField;
    }

    frontPlane
    {
        type            empty;
    }

    backPlane
    {
        type            empty;
    }

    TOP
    {
        type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

}


// ************************************************************************* //
